src/test/resources/benchmark_out/2024-08-03/ryzen_9_3900X/out_openpdf.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 25.30s, 1976.29 req/s, 18.93MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 478.87MB (502128660) total, 148.42KB (151980) headers (space savings 94.54%), 477.62MB (500825240) data
                     min         max         mean         sd        +/- sd
time for request:      453us    152.54ms     29.88ms     19.88ms    68.87%
time for connect:       55us       790us       379us       203us    60.00%
time to 1st byte:     7.73ms     82.68ms     23.00ms     17.63ms    81.67%
req/s           :      32.93       34.85       33.43        0.40    75.00%