src/test/resources/benchmark_out/2024-08-03/ryzen_9_3900X/out_pdf-fop-pool.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 16.94s, 2951.92 req/s, 49.51MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 838.68MB (879419920) total, 148.48KB (152040) headers (space savings 94.57%), 837.15MB (877816560) data
                     min         max         mean         sd        +/- sd
time for request:     1.84ms    146.74ms     20.12ms     14.76ms    82.01%
time for connect:       77us       981us       496us       267us    60.00%
time to 1st byte:    16.47ms    123.00ms     53.16ms     23.85ms    66.67%
req/s           :      49.18       50.94       49.63        0.38    76.67%